report.example/oltp_read_write_128threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 3373.78 qps: 69355.11 (r/w/o: 48783.04/13700.74/6871.33) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 3522.09 qps: 70473.90 (r/w/o: 49284.33/14144.38/7045.19) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 3623.01 qps: 72642.17 (r/w/o: 50834.12/14561.03/7247.02) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 3726.94 qps: 74172.78 (r/w/o: 51997.14/14727.76/7447.88) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 3646.04 qps: 73194.71 (r/w/o: 51224.49/14673.14/7297.07) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 3654.01 qps: 72833.27 (r/w/o: 51009.19/14519.05/7305.03) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 3698.00 qps: 73977.02 (r/w/o: 51787.02/14793.00/7397.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 3607.00 qps: 72406.06 (r/w/o: 50683.04/14506.01/7217.01) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 3621.01 qps: 72280.11 (r/w/o: 50494.07/14549.02/7237.01) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 3677.98 qps: 73783.61 (r/w/o: 51636.72/14787.92/7358.96) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 128 tps: 3694.99 qps: 73484.81 (r/w/o: 51532.87/14568.96/7382.98) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 3655.03 qps: 73137.68 (r/w/o: 51096.47/14726.14/7315.07) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 128 tps: 3655.99 qps: 73133.88 (r/w/o: 51393.92/14423.98/7315.99) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 128 tps: 3634.97 qps: 73144.31 (r/w/o: 51060.52/14812.86/7270.93) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 3711.01 qps: 73651.28 (r/w/o: 51674.20/14558.06/7419.03) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 128 tps: 3659.02 qps: 73342.40 (r/w/o: 51267.28/14754.08/7321.04) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 128 tps: 3659.01 qps: 73324.12 (r/w/o: 51286.08/14723.02/7315.01) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 3649.00 qps: 73322.93 (r/w/o: 51221.95/14799.99/7300.99) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 128 tps: 3585.00 qps: 71369.02 (r/w/o: 50075.01/14126.00/7168.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 3603.99 qps: 71707.73 (r/w/o: 50276.81/14228.95/7201.97) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 3672.02 qps: 73614.36 (r/w/o: 51532.25/14732.07/7350.04) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 128 tps: 3638.00 qps: 73146.01 (r/w/o: 51041.01/14830.00/7275.00) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 128 tps: 3649.00 qps: 72804.95 (r/w/o: 50969.96/14536.99/7297.99) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 3699.00 qps: 73776.08 (r/w/o: 51807.06/14570.02/7399.01) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 128 tps: 3662.95 qps: 73487.01 (r/w/o: 51296.31/14866.80/7323.90) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 128 tps: 3735.04 qps: 74300.73 (r/w/o: 52121.51/14716.15/7463.07) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 3628.00 qps: 72686.91 (r/w/o: 50950.94/14467.98/7267.99) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 128 tps: 3645.01 qps: 73285.23 (r/w/o: 51100.16/14901.05/7284.02) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 128 tps: 3676.00 qps: 73310.92 (r/w/o: 51404.94/14551.98/7353.99) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 3697.96 qps: 73693.12 (r/w/o: 51655.38/14639.82/7397.91) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1532930
        write:                           437980
        other:                           218990
        total:                           2189900
    transactions:                        109495 (3645.61 per sec.)
    queries:                             2189900 (72912.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0336s
    total number of events:              109495

Latency (ms):
         min:                                    1.80
         avg:                                   35.09
         max:                                  216.31
         95th percentile:                       75.82
         sum:                              3842635.45

Threads fairness:
    events (avg/stddev):           855.4297/48.77
    execution time (avg/stddev):   30.0206/0.01